:PROPERTIES:
:ID:       297E7DEE-315F-4F8D-8F96-FFB2C6D598DB
:END:
#+title: 2022-04-10
#+HUGO_SECTION:daily
#+filetags: :draft:
#+filetags: :draft:
* Spanish!!!!!!!!
The Exam is due Wednesday, <2022-04-13 Wed> which is 3 days from now.
I should start my preparation right away.

I like spanish, so I'll make the work open-ended, and managable, so that it'd not be just a one-time show, but part of the greater spanish machine.

** update: only 1 day
The test is 
** Weapons
*** Direct Practice
This exam have listening part. I speak the language to be able to listen it. I speak sentences.

So collect sentences for [[Flashcard]] !
*** Flashcard
Having spanish being a language, flashcard make a big part of the useful weaponry.
I used to use Anki to rule the exam, but this time, I'll be using =org-drill=. 
*** Notes
The test is open-book, no reason I don't make good print note for use.
Maybe a function to print my org notes!
Charts, illustrates, and Mindmaps are useful tools, Chart being the best I think.
*** Resource
** Exam content
*** 1. Listening Comprehension (.24)
1 listening, 12 question
*** 2. Reading Comprehension (.15)
1 article, 6 question
*** 3. Grammar (.21)
2 Large question, no MCQ
*** 4. Writing Task (.40)
2 Large Task, 1 on sentences, 1 on paragraph.
** Resources
*** Wechat Log
**** 1
@所有人 感谢大家参与！
1. 今日答疑的回看录播（也在群公告里平时课程视频的同一个文件夹里）：
https://box.xjtlu.edu.cn/f/c0dbd172136c434b9da6/

2. 今天玩的几个小游戏（以及以后打算找机会课堂玩的……）都上传到Extra Pratice里了：
https://www.learningmall.cn/course/view.php?id=3273&section=9
另外推荐一个动词变位趣味练习网站Conjuguemos，有学习模式和游戏模式，不需要注册就可以用：
https://conjuguemos.com/activities/spanish/verb/1

3. 平时学习推荐使用的西英词典（考试时不可以用）：
WordReference: https://www.wordreference.com/
SpanishDict: https://www.spanishdict.com/
Collins Spanish Dictionary: https://www.collinsdictionary.com/dictionary/english-spanish
Linguee: https://www.linguee.com/
据不完全统计，习惯性依赖西语助手的同学，平均成绩明显低于学会使用以上词典之一的同学。

4. 考试的时候不可以使用如TypeIt (https://spanish.typeit.org/) 这类帮助输入特殊字符的网站，因为这也属于打开了其他网站。也不可以另开Word文档复制粘贴，因为这属于打开了其他软件。
西语输入法使用教程见以下视频和键盘布局。

5. 强烈建议不要使用iPad或手机之类的移动设备考试，很可能会出现浏览器跟LMO页面设计不兼容，导致显示不正常的情况（平时quiz已经出现这样的问题了）。学习和考试这么重要的事情，就还是开一下电脑吧。
**** 2
@所有人  整理了一下昨天mock全程的聊天记录，统一答复所有问题：
***** 关于考试流程（这个过两天会再发个正式的）：

1. 不用打开自己面前电脑的摄像头。
2. 做听力部分的时候允许使用耳麦。
3. 全程允许使用纸笔打草稿或做记录。
4. 再说最后一遍，电子的、数码的、虚拟的、网络的……非纸质的学习资料或其他设备、软件，一律不可以使用。
5. 听力音频的BOX备用链接就做在题目的Instructions里，超链接处字体颜色有所不同，鼠标挪上去的时候指针会变……
6. 开启代理或VPN有可能会影响到LMO的连接状态，尤其是在翻页或提交修改的时候，建议提前检查好自己的网络连接设置。
7. 遇到意外情况请及时截图截屏（Win 10截屏快捷键：Windows + Shift + S），或者立即跟监考老师沟通，经允许后拍照存据。
8. 万一学校官方SSO账号登录不了，只要用普通账号能登入并改为真实姓名都可以。
9. 学生在进入瞩目会议室以后会被自动静音，监考老师除必要通知外也会静音，如果因为这一设置导致了听不见听力音频，请尝试将麦克风和扬声器都设置为“与系统一致”。
10. 正式考试之前为了调试设备一定提前半小时加入，这样在考试过程中就不太会被提醒了。

另外，我给昨天模考过程中曾通过Chat提醒过后置设备位置问题的所有同学刚才又发了邮件提醒。总的来说要么就是位置太低，导致屏幕上半截看不见，要么就是位置接近正后方，导致你自己挡住了大半屏幕。建议就是把后置设备的视角放在与电脑桌面相似高度，然后再偏左或者偏右一点就可以了。
***** * 关于考试内容：

正式考试每一个部分都会比模拟更难。听力和阅读更长，并会包含多种题型。语法部分没有选择题，并且最后还有写作练习（句子和短文）。前后可以翻页。模拟成绩不够理想的各位请加油复习和解决疑问。模拟结果还不错的，请注意在正式考试的时候把握时间（不要因为开卷而过于纠结磨蹭完美主义）。建议尽量给整个第四部分（Writing Tasks）预留40分钟时间。
***** * 关于考前复习：

1. 时间日期的读法会再讲。
2. LMO上所有到期关闭的quiz（包括昨天的mock）全部都重新开放了。
3. 周四下午14:00-16:00有统一直播答疑活动。
*** learning mall
Dates in Spanish: How to Write and Ask Any Date (Interactive Calendar) https://spanishnumbers.guide/dates-in-spanish.html
https://www.learningmall.cn/mod/quiz/view.php?id=226115
https://www.learningmall.cn/course/view.php?id=3273&section=5
https://www.learningmall.cn/mod/page/view.php?id=202233
** Plan
*** TODO Class notes -> #org-drill
:LOGBOOK:
CLOCK: [2022-04-12 Tue 15:46]--[2022-04-12 Tue 17:04] =>  1:18
CLOCK: [2022-04-11 Mon 10:49]--[2022-04-11 Mon 11:50] =>  1:01
CLOCK: [2022-04-10 Sun 21:03]--[2022-04-10 Sun 21:03] =>  0:00
CLOCK: [2022-04-10 Sun 16:30]--[2022-04-10 Sun 16:30] =>  0:00
CLOCK: [2022-04-10 Sun 16:02]--[2022-04-10 Sun 16:29] =>  0:27
:END:
attach org-drill tag to the class notes, and fill them right.
+ [X] 1 hour to fill and drill all once.
*** TODO 标准西班牙语语法精解与练习
*** TODO Class Slides
